Revit 2026 API
DocumentPreviewSettings Class
 Contains the settings related to the saving of preview images for a given document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DocumentPreviewSettings
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class DocumentPreviewSettings : IDisposable
Public Class DocumentPreviewSettings
	Implements IDisposable
public ref class DocumentPreviewSettings : IDisposable
type DocumentPreviewSettings =
    class
        interface IDisposable
    end
The DocumentPreviewSettings type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
IsViewUpdateForced |  Identifies if Revit will update the preview view if necessary.
PreviewViewId |  The view id that will be used to generate the preview.
Top
Methods
Name | Description
Dispose | Releases all resources used by the DocumentPreviewSettings
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
ForceViewUpdate |  Sets Revit to update the preview view if necessary.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsViewIdValidForPreview |  Identifies if the view id is valid as a preview view id.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace